var qs = {
    0: {
        q: "请选择你的性别: ",
        a: [{ o: "男", t: 1 }, { o: "女", t: 2}]
    },
    1: {
        q: "你一男的瞎掺和啥!! 一边儿去!!"
    },
    2: {
        q: "请选择你的年龄阶段: ",
        a: [{ o: "小于16岁", t: 3 }, { o: "16~19岁", t: 5 }, { o: "大于19岁", t: 4}]
    },
    3: {
        q: "小朋友去其他地方玩哈, 这儿不是你该来的."
    },
    4: {
        q: "你都一把年纪了... 还玩这个? 快快, 别围观了, 散了吧."
    },
    5: {
        q: "以下几个词语中, 你认为哪一个最能描述你自己?",
        a: [{ o: "聪明", t: 6 }, { o: "漂亮", t: 6 }, { o: "善良", t: 6 }, { o: "平凡", t: 6}]
    },
    6: {
        q: "以下几个词语中, 你最希望自己能被哪一个词语描述?",
        a: [{ o: "聪明", t: 7 }, { o: "漂亮", t: 7 }, { o: "善良", t: 7 }, { o: "平凡", t: 7}]
    },
    7: {
        q: "你周围的人认为你漂亮么?",
        a: [{ o: "认为", t: 8, p: 1 }, { o: "不认为", t: 8 }, { o: "只有同性认为", t: 8}]
    },
    8: {
        q: "以下几个短语中, 哪一个最贴近你的性格?",
        a: [{ o: "很成熟", t: 9, p: 1 }, { o: "稳重而不失天真", t: 9, p: 3 }, { o: "天真而单纯", t: 9, p: 2 }, { o: "顽皮", t: 9, p: 1 }, { o: "浮躁", t: 9}]
    },
    9: {
        q: "你认为自己具有艺术家潜质么?",
        a: [{ o: "非常具有", t: 10, p: 1 }, { o: "具有一些", t: 10 }, { o: "不怎么有", t: 13}]
    },
    10: {
        q: "你擅长绘画么(不必很专业)?",
        a: [{ o: "擅长", t: 11, p: 1 }, { o: "不擅长", t: 11}]
    },
    11: {
        q: "你擅长唱歌么(不必很专业)?",
        a: [{ o: "擅长", t: 12, p: 1 }, { o: "不擅长", t: 12}]
    },
    12: {
        q: "你是否善于写作与诗朗诵?",
        a: [{ o: "是", t: 13, p: 1 }, { o: "否", t: 13}]
    },
    13: {
        q: "朴素自然的美与精致华丽的美你更喜欢那一种?",
        a: [{ o: "朴素自然", t: 14, p: 1 }, { o: "精致华丽", t: 14}]
    },
    14: {
        q: "你有因为非医疗问题而打耳洞或其他类似的东西么?",
        a: [{ o: "有", t: 15 }, { o: "没有", t: 15, p: 1}]
    },
    15: {
        q: "抛开传统或者世俗的观念, 你认为自己是一个好孩子么?",
        a: [{ o: "是", t: 16, p: 1 }, { o: "不是", t: 16}]
    },
    16: {
        q: "哪一个词语更能描述你目前所处的情感阶段?",
        a: [{ o: "恋爱中", t: 17, p: -999 }, { o: "刚分手", t: 17 }, { o: "有喜欢并且希望追求的人", t: 17, p: -999 }, { o: "没有特别喜欢的人", t: 17, p: 1}]
    },
    17: {
        q: "你是同性恋么?",
        a: [{ o: "是", t: 18, p: -999 }, { o: "不是", t: 18}]
    },
    18: {
        q: "哪一个词语更能描述你目前情感方面的期望?",
        a: [{ o: "非常期望能找到一个喜欢的人", t: 19, p: 2 }, { o: "有考虑过找一个人", t: 19, p: 1 }, { o: "暂时没有考虑", t: 19}]
    },
    19: {
        q: "你认为自己更倾向于现实主义还是理想主义?",
        a: [{ o: "现实主义", t: 20, p: -999 }, { o: "两者平衡", t: 20 }, { o: "理想主义", t: 20, p: 1}]
    },
    20: {
        q: "你有尝试对自己人生进行规划吗?",
        a: [{ o: "有", t: 21, p: 1 }, { o: "没有", t: 21}]
    },
    21: {
        q: "如果你的男/女友只能具备聪明与帅气/漂亮二者之一(不聪明指智力正常, 不帅气/漂亮指不算好看), 你会选择哪一个?",
        a: [{ o: "聪明", t: 22, p: 1 }, { o: "帅气/漂亮", t: 22}]
    },
    22: {
        q: "你的身高在那个范围?",
        a: [{ o: "小于162cm", t: 23 }, { o: "162~168cm", t: 23, p: 1 }, { o: "168~176cm", t: 23 }, { o: "大于176cm", t: 23, p: -999}]
    },
    23: {
        q: "以下哪一个词语更能描述你的体型?",
        a: [{ o: "骨感", t: 24 }, { o: "苗条", t: 24, p: 1 }, { o: "匀称", t: 24, p: 1 }, { o: "丰满", t: 24, p: -999}]
    },
    24: {
        q: "你喜欢孙燕姿吗?",
        a: [{ o: "挚爱", t: 25, p: 2 }, { o: "喜欢", t: 25, p: 1 }, { o: "一般", t: 25 }, { o: "反感", t: 25, p: -999}]
    },
    25: {
        q: "你喜欢(不管是否抽出了时间去做)探索这个世界的奥秘吗?",
        a: [{ o: "喜欢", t: 26, p: 1 }, { o: "不喜欢", t: 26}]
    },
    26: {
        q: "以下哪一个词语更能评价你的英语口语水平",
        a: [{ o: "棒极了", t: 27, p: 2 }, { o: "不错", t: 27, p: 1 }, { o: "不怎么好", t: 27}]
    },
    27: {
        q: "恭喜你, 你已经完成了所有题目.",
        f: true
    }
};